In [53]:
import pandas as pd

In [60]:
train_set = pd.read_csv("datasets/train.csv")

train_set_x = train_set.copy()

In [61]:

# dropping name and Ticket columns
## The name and ticket date doesn't uniquely signify survivabilty of a soul on board of the RMS titanic
train_set_x.drop(['Name','Ticket'], axis=1, inplace=True)
train_set_x.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,71.2833,C85,C
2,3,1,3,female,26.0,0,0,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,53.1000,C123,S
4,5,0,3,male,35.0,0,0,8.0500,NaN,S